
## Terraform plan for environment: `dev`

**Commit:** 0b18ebe9646ae90ebc0520ec54785a62cdbc56be


**API version:** 418eb0c
**CLI version:** 418eb0c
**Selfserve version:** 418eb0c
**Internal version:** 418eb0c

### Plan summary

`2 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.eventbridge.aws_scheduler_schedule.this["process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-ntu"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-inbox"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-inbox"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-inbox-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(45 01 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:3"
                  + JobName       = "vol-app-dev-process-inbox"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-ntu"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-ntu"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-ntu-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 18 ? * 1-5 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:3"
                  + JobName       = "vol-app-dev-process-ntu"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>